/* string */
"привет, \n  \"Мир\"!";
'\tлес';
`как дела?`;
' ';

// number
12;
34.6;
1e5;
0;

// boolean
true;  //<input type=radio checked />
false;

//null
null;

//undefined
undefined;

//object
({
  "firstName": "Иван",
  lastName: 'Иванов'  
});
[23, 45, 100];
function foo(){ }

//арифметические операторы
10 + 3;
10 - 3;
10 / 3;
10 * 3;
10 % 3;
10 ** 3;

//оператор группировки 
2 + 2 * 2;   //6
(2 + 2) * 2; //8
(function (){ })

//строковый
"привет" + 'Мир';//"приветМир"
3 + '5'; //'35'
2 + 2 + '2'; '42'
'2' + 2 + 2; '222'
3 + '5' - 1; //34
'100кг' - 10; //NaN

//определение типа
typeof 34;
typeof true;
typeof {name: 'Иван'};
typeof 'тест';

//сравнения
5 == 3; 
'привет' == 'привет';
5 == '5'; 
5 === '5'; 
4 > 5;
"Маша" < "Медведь";
"Мария Ивановна" < "Медведь";

//логические операторы 
!true;
!false;
!!true;
!'привет';

false || false; //false
false || true;  //true
true  || false; //true
true  || true;  //true

false && false; //false
false && true;  //false
true  && false; //false
true  && true;  //true

"привет" || 25 || 0;
25 || "привет" || 0;
0 || "привет" || 25;
"привет" && 25 && 0;
"" && 25 && 0;
"привет" || 25 && 0;

(5 && ("специалист" || !0)) && !(0 && (56 || true));
(5 && ("специалист" || !0)) && !(0 && 56);
(5 && ("специалист" || !0)) && !0;
(5 && ("специалист" || true)) && true;
(5 && "специалист" ) && true;
"специалист" && true;
true;

/*
специалист  
5           +++++
0           
1           
true        ++++
false       
56          
44          
*/ 

//создание переменных
var firstName; //undefined
var firstName = 'Иван';
let lastName = 'Иванов';
lastName = 'Иваноф'
const hands = 2;

//пример переменной с let в локальной области видимости
{
  let t = 5;
  t = 3;
};
//console.log(t);

//объявление нескольких переменных
let a = 1, b = 2, c = 3;
  







